Rebar elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Rebar Type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoSurfPatternOnRebar { get; }
  Visual Basic
Public Shared ReadOnly Property NoSurfPatternOnRebar As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoSurfPatternOnRebar {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace